In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv('../data/raw/co2_emissions_kt_by_country.csv')

In [3]:
data.head()

  country_code country_name  year      value
0          ABW        Aruba  1960  11092.675
1          ABW        Aruba  1961  11576.719
2          ABW        Aruba  1962  12713.489
3          ABW        Aruba  1963  12178.107
4          ABW        Aruba  1964  11840.743

In [4]:
data.isna().sum()

country_code    0
country_name    0
year            0
value           0
dtype: int64

In [5]:
data['year'] = pd.to_datetime(data['year'], format='%Y')

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13953 entries, 0 to 13952
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   country_code  13953 non-null  object
 1   country_name  13953 non-null  object
 2   year          13953 non-null  datetime64[ns]
 3   value         13953 non-null  float64
dtypes: datetime64[ns](1), float64(1), object(2)
memory usage: 436.2+ KB

In [7]:
data.columns

Index(['country_code', 'country_name', 'year', 'value'], dtype='object')

In [8]:
data.rename(columns={'value': 'co2_in_kt'}, inplace=True)

In [9]:
data

      country_code country_name       year     co2_in_kt
0              ABW        Aruba 1960-01-01  11092.675000
1              ABW        Aruba 1961-01-01  11576.719000
2              ABW        Aruba 1962-01-01  12713.489000
3              ABW        Aruba 1963-01-01  12178.107000
4              ABW        Aruba 1964-01-01  11840.743000
...            ...          ...        ...           ...
13948          ZWE     Zimbabwe 2015-01-01  12430.000305
13949          ZWE     Zimbabwe 2016-01-01  11020.000458
13950          ZWE     Zimbabwe 2017-01-01  10340.000153
13951          ZWE     Zimbabwe 2018-01-01  12380.000114
13952          ZWE     Zimbabwe 2019-01-01  11760.000229

[13953 rows x 4 columns]

In [10]:
!dir

 Datentr„ger in Laufwerk C: ist OS
 Volumeseriennummer: A27B-F329

 Verzeichnis von C:\Users\schue\IronHack\Bootcamp\Week_5\mid_project\notebooks

19.12.2023  08:32    <DIR>          .
18.12.2023  14:51    <DIR>          ..
18.12.2023  17:05    <DIR>          .ipynb_checkpoints
18.12.2023  17:57            11.814 co2_emissions_cleaning.ipynb
19.12.2023  08:28             8.703 gdp_cleaning.ipynb
18.12.2023  16:52            35.844 global_temperatures_cleaning.ipynb
19.12.2023  08:32            23.963 join_dataframe.ipynb
               4 Datei(en),         80.324 Bytes
               3 Verzeichnis(se), 34.098.692.096 Bytes frei

In [11]:
data.to_csv('../data/cleaned/co2_emissions_kt_by_country_clean.csv', index=False)